{"podcast_details": {"podcast_title": "Outspoken with White & Jordan", "episode_title": "Could Sarina Wiegman be Gareth Southgate's replacement?", "episode_image": "https://assets.pippa.io/shows/61ba21f51a8cbe75bb3cf280/1668780831114-f276576b8d075757da08daea3cd783e3.jpeg", "episode_transcript": " Outspoken with White and Jordan. 100% engagement. It's a total disrespect. Download, stand well back, listen. Jim White and Simon Jordan. I don't see that view. Outspoken with White and Jordan. From the world's biggest sports radio station, TalkSport. Hello and thanks for downloading Outspoken, the podcast that brings you the very best of our daily TalkSport show. England have a World Cup final to contest on Sunday, but the future of manager Serena Vigman is up for discussion. Could she take charge of the men's side one day? Plus, how well have Crystal Palace done to keep hold of Michael Alise? And Martin Keown gets going once again on that topic of player welfare. A few raised eyebrows yesterday when the man at the top of the FA, the chief executive, Mark Bulliam, gave a pre-World Cup final, if you like, interview. And quite rightly, he said, Serena, Serena Vigman, of course, doing the Lionesses a great job. It's critical that she does that job and she's doing a brilliant job at that. And then he carried on. If at some point in the future she decides she wants to move into the men's game, I think that would be a really interesting discussion. But that's for her, right? Yeah, it is for her, I'm pretty sure. He says, we don't like suggesting the men's team is above that. Serena's doing a great job in what she's doing. Secondly, I don't like the language when we say, should it be the best man for the job? I think it's the best person for the job. And then he says, from our point of view, Serena's doing a great job in what she's doing and we want her to keep doing that. If and when we get a vacancy in either of our senior men's or women's manager positions, we would go for the best person for the job, which would be the best person capable of winning matches. We're joined by Talksports Lionesses correspondent, Courtney Sweetman Kirk. Courtney, good morning to you. First off, the atmosphere down there must be building up a pace towards Sunday, is it? Yeah, it definitely is. Everyone's really excited. As you'd imagine, a World Cup final, we're currently in Terregal, the base for the Lionesses. And yes, there is excitement, but there's also a nice calmness about the camp as well, which I'm feeling good about. What was your take on what Bullingham said yesterday? I mean, you've been in the thick of it, Courtney, and of course, you know the women's game inside out and you know Serena inside out. Can you envisage the day that the first ever female manager in the men's game comes in the biggest, most high profile job possible? England, in other words, could you ever envisage Serena doing what Southgate does? I could. You know, I've had the pleasure of being around her. I think she's been fantastic, as I think I've said many times. She's so charismatic as a person and open and giving with what she gives us. But in terms of obviously what happens on the pitch and what she's created for the Lionesses in the FA has been nothing short of phenomenal. She's brought that winning culture at the mentality to the Lionesses. And I'm sure she's got the ability to bring that to the men's team. If she chose that way and she wishes, that's the path that her career might want to take after contracts up in 2025. That said, Courtney, do you think William should be speaking like this before such a huge feature, the biggest ever? Well, I think it's difficult, isn't it? He's in a position where the questions have been asked of him as well. So, you know, he's got to answer those questions in a certain way from the press. I think he answered it well, if you look at sort of the full statement of it. And I think it's difficult, isn't it? Because I agree in terms of I don't think this is what we should be talking about before a major World Cup final. I think we should be talking about how well the girls have done, how well Serena's done and focusing more on that rather than something else. But, you know, it's the world we live in. And as I say, it's the question that's been asked of him. And I think, as you say, if you look through the full manuscript of what he said, he's answered it in the right way. He's talking about how he wants the FA to be diverse in their talent pool and who they employ. You know, when the time does arise, there might be a vacancy within the men's side. Courtney, stay with us. Simon and Martin are with me. So the chief executive, Simon Mark Bullion, believes there's no reason why Serena Vigman should not be considered for the England men's manager job in the future. Is he right to think that? Was he right to answer the question even before Sunday's final? No, I don't think it's a necessary conversation at this moment in time. What you've got is a women's World Cup final. That is the subject matter. If other people want to take it off in directions and talk about the advancement of women in men's sport, then that's a conversation that they can have amongst themselves. The head of the FA doesn't need to disappear into an ESG mentality of deciding that I need to address things in a certain way because we need to be steeped in equality, diversity and inclusivity. What we need to be is steeped in the best in class. If we get to a point, and I think most sensible people know that there was a very significant difference at this moment in time between women's football and men's football in terms of the level of technical ability and the achievements of the two games. Now that's not to suggest over a period of time that those gaps won't be closed. What I would like to think is that the best in class, I'm one of those people that believes the best in class should get the job. And I don't really care if it's someone of a different gender than the sport that we're talking about in this instance, the men's sport. I don't care about ethnicity, I don't care about any of it. All I ever wanted in my life was to have the best in class. I don't think it's a grown up conversation at this moment in time. I think it's an agenda driven one. If you're the head of the FA, you don't have to answer these questions. You don't have to drive yourself into a situation where you want to appear to be operating in a certain way. I think the guys are flake. I think selling the FA Cup and wanting to sell Wembley Stadium and other things that the FA should be attending to more with more importance, I have more prevalence in terms of competency than addressing an issue that's not really an issue at this moment in time. It may well be for those that believe it's the necessary step. It's a necessary step. We must now have equality in men's sport by having women represented in it. And that may well be when women get to the top of the table and best in class and they can operate in a sport which is polar different right now. There is vast difference between men's football and women's football. What Serena Wigman is doing is a remarkably good job in the space that she's in right now. You would preclude her from getting the Southgate job is what you're saying. Well I don't think it's a conversation. Because of polar differences. Well I think right now we need to see, you know I have no objection to it. A lot was made of the fact that Del Vince put Hannah Langley in situ to manage the Forest Green Rovers job and people turned around and looked at that in a certain way and then she was there for five minutes as she was gone. When we see women operating within the confines of men's football and operating at a very high level in the domestic game because there is a difference, there's a difference in language, in expectations, in physicality, in the technical ability, in size and scale, in experiences, in scale of the operation and size. But what we're seeing right now is a remarkable transition in women's football. We put a man into women's football and they couldn't achieve anything vaguely resembling what Serena Wigman achieved in Phil Neville. If the example is being made about well if you can translate from women's football, if you can be successful in women's football, you can be successful in men's. If you run a business with ten people in it, it doesn't mean that you can run a business with a thousand people in it. There's different skill sets. I'm not ruling it out. I don't have any objection to it. There's no misogyny in suggesting that there's a time and a place for it. But I think it's an unnecessary, he wanted to have this conversation. He wants to position the FA in a certain way. What I would like to see the FA positioned is a competent organisation and I'm not entirely sure that they are. Well he's been questioned in this area and he has to, because of Serena Wigman's success on the pitch and the women's team, the development of that, that's the reason why this question has been posed. But it's very easy Martin isn't it? I'm here to talk about the women's FA, women's World Cup final. These other things can happen in different conversations. The sole focus is right now. But what else was he to say? Precisely that. Shut it down. Well he could have done but then he would have been probably criticised for that too. I think it's a very interesting topic. I think I'd like to see Serena Wigman, if she were given the opportunity to go into the professional men's game, not at international level but maybe at club level, to sort of earn that gym, that respect I suppose, to be the acceptance because we are in the middle of change, huge change. My reservations are that the professional game for ladies are not their own fault by the way because of the ban that took place from 1921 for 50 years they discriminated against. They weren't allowed to play football which was a disgrace. But the FA now of course is working to develop the WSL game which is, you know, and they're a big advocate for that and that should be applauded. Whether the game now eventually splits away and forms like a Premier League as the men's game does, all those possibilities are there but these are sort of the first steps. So I think Serena Wigman would be a massive loss to the women's game if she was to come to the men's game. I think Courtney you'd agree with that and that, it should be a huge loss. I feel for now she should be allowed to stay there but her choice is her choice. Well I don't think it's whether she'll be allowed to say that. I think if she wins it in Sunday she can do what she wants but Courtney the bottom line is this, the men's game and the women's game are very different are they not? But would you advocate, yeah, sooner than later and if it's Wigman it's Wigman, someone's got to do it so why not now? Are you pushing, would you push that? Yeah, I mean I'm taking, I'm loving this conversation to be honest because I like having this conversation in the sense that it needs to be had. I do think there's such a proclivity to compare the men's and women's game. It is different and we can't get away from that and we can, you know, enjoy them both and you know going back to the comment you know Simon made about Phil Neville, I get that he's played at the highest level but he's never even coached really at the highest level in the men's game. Courtney, Courtney, Courtney, just to say, Courtney, just, you know, I'm loving this conversation too so I just want to know what was the feeling amongst the players when there was a player, a men's player, former player, top level coming into your game and not really within the necessary credentials. Was there a problem of acceptance for him? I think there was to a degree, I think look the women's game is accepting so it was never a case of shunning Phil Neville but like we, you know, we've talked about he hasn't even coached at the top level within the women's or the men's game so to go in straight at the top, you know, as an England manager for me, I'm not speaking for anyone else, for me it felt like a publicity stunt, as simple as that because how we put someone that hasn't. Well he did two years as a Manchester United coach, no? He was doing, he was gaining a lot of experience, he hadn't been a manager, granted. Yeah but I think that's very different to being day in, day out, working, earning your stripes to, you know, for an example I know that the games are different but you would never put a manager in with that experience, level of experience to a top level men's England team without a doubt so to do it at the women's, like I say that's my personal thought, I felt like it was a publicity stunt. But with respect Courtney, if you pair that back to Mark Sampson and look at the evolution of women's football and go back to Hope Powell, it's about where we are in the curve and where the game is being developed to and what level it's at and where we think people are developing at their best. Now the Women's World Cup started in 1990 and we're moving through the gears now to a far more professional, far more competent, far more technically adept and adroit set of elite women footballers. The argument that will be pitted by those that want to have this argument and this is a grown up conversation, some people don't want to have a grown up conversation, will be about creating division and advancing agendas. When Graham Soonest spoke last year after a game about a man's game being played by men, it was leveraged by certain people, one of them being a current England player, to turn it into some sort of division between men and women. I don't think there needs to be division. If women's football develops at the rate that it's developing, it will catch up to a point where the levels are at some point perhaps comparable and then that conversation can happen and then if there's an exclusion then people can start talking about equality. Yeah, Williams comments at this particular time going into the World Cup final could by some be viewed as somewhat divisive. It's hard isn't it because he's been asked the question and I do get what Simon's saying in the sense that he needs to potentially not answer that question but there's always two sides to the coin in the way that things get construed. So if he doesn't answer that question it might be right, well they don't believe in Serena, they don't believe that there should be a women in the men's side. I think he's got caught in the fire where he's sort of covered all bases with his answer, he's not said yes, he's not said no, I think he's probably tried to sort of pedal a line with the FA in terms of trying to do and say the right thing at the right time. It's disrespectful to the women's game Courtney, the women's game needs the best talent. Why is there an assumption that as a matter of course all roads must lead to the men's game, why does it have to be that particular conversation that needs to happen? You've got an elite manager managing England's women that are achieving things that the men can only dream of right now and why do we have to have a conversation about her hop tailing it off to the men's game? The women's game is an elite game. I totally agree. And I think it's disrespectful and if I was the FA, I wouldn't answer that question, he chose to answer that question and if he's entirely honest, if we're entirely honest while we have this conversation and share this moment together, at this stage in the evolution of women's football, they're not at that level. That's not to suggest they won't be, that's not to suggest that there's not a pathway for that to happen and when it does happen that it should be embraced. But if people are being honest, if you ask Mark Bullingham, in the next 18 months could you imagine really honestly that Serena Vigman is capable when Gareth Selfgate's contract runs out at the end of the next tournament of running the England men's team, the answer honestly if we're not frightened of the conversation is probably no. But that doesn't mean no in perpetuity, it means let's throw our resources behind getting the women's game to the highest level so that the uniqueness of the men's games is at least equaled or paralleled by the women's game. Yeah, I mean there's one interesting point being made by one of the listeners this morning and many people get in touch Courtney as you might imagine on this one. David in Newark, after Spain win the thing on Sunday, well we don't know if they will or they won't, would Vilda be considered for the men's job for Spain? Well the answer to that to be honest Courtney is probably not isn't it? Yeah probably not and you know if people know the situation with Spain coming into this tournament as well, it's been very very turbulent in terms of lots of issues within that camp and them not wanting him to even be in the women's job, let alone the men's job, so I can't see that happening. But what I will agree with with Simon is it's disrespectful at this moment in time. We should be talking about the wonderful achievement of these girls and Serena Vigman and what she has done and potentially winning a World Cup on a historic day for English football and not seeing, you know, there's as I say there's a proclivity to compare the women's in the men's game, we don't have to do that, we can enjoy them for what they are and what it is and not see right. Well she's done that so she's going to go and do something in the women's game. 100% engagements, outspoken with White and Jordan. It's all going to transfer, Chelsea have got their man Romeo Lavia, Liverpool wanted him, Chelsea have got him, that's got a familiar ring to it hasn't it, 58 million quid. So Lavia will line up with Moises Casado at Stamford Bridge next season, we'll get to that shortly. One guy who will not be lining up for Chelsea is Crystal Palace's Michael Alisi. It looked like he'd be leaving, it looked like 35 million would trigger it and he'd be out of there, but no. Palace Simon, I've nailed them down, I saw Steve Parrish speaking on it last night and Alisi stays, it's a four year deal. Roy Hodgson for one was thrilled. It's the best possible news that we could have, we've been concerned, one is concerned when a club of Chelsea's stature start to take an interest in a player and suggest that a move to them might be the best bet. I've always hoped that wouldn't be the case and that Michael would realise that at such a young age his future here is very bright and we can help him move very quickly to another level if that's going to happen in time. But of course the decision has been his and I'm just delighted now that the club and I must congratulate Steve Parrish and Doug Freeman on the fantastic job they've done in persuading him that with this pressure from the outside and this is your place, this is where we think you will progress in the right way, you will develop in the right way. And of course as a coach and manager it's perfect because to lose to players like Zaha first and then Alisi that would have changed to some extent my perception of it also for me it's a red letter day. Good, so Palace fans will rejoice in that. Now Martin, I must admit I was fully expecting to be sitting here this morning saying it's a Chelsea player and it hasn't happened, he stays. You've seen him at closed quarters no doubt working last season, I mean how significant is this? Yeah, I mean I think it's very significant that they've, we know they haven't really bought anybody in the summer but it's imperative that now that Zaha has gone that they pin something on this player because I do believe he's an incredible talent Jim. If we looked at the end of last season when they pretty well put Leeds down he had three assists, I think he's the youngest player to do that in the Premier League. This guy is top draw, we saw him at Reading coming through the academy, he was the EFL Young Player of the Year in 2021, his debut Jim, he was a slow burner I'd have to say but now he's been quite magnificent so without Zaha being there you can see they always like to pin something on real talent, they got him for 8.5 million, yes there's a clause now they protected themselves, interestingly he didn't play at the weekend so he's there very available. He's still very young Jim and as a young player he was at, believe it or not he was at Arsenal, he was at Chelsea, he was at Man City and maybe he just feels he needs a little bit longer he's only played 67 games for Palace, 120 games in total, he's still very young, he's still yearning, he's French, well he's born in England, I think there still might be a chance he can play for the 21s for England, I don't know where that's going to happen because Gareth likes to, that total commitment doesn't he, tell me you're English and there's a doubt there, he's a fantastic talent. I mean Simon is this a situation where a young player like Alise has been well advised? Listen, he looks like a brand new player for Palace doesn't he? I mean ultimately if one was cynical one would suggest that Palace haven't signed any players and ultimately have now managed to engineer a situation with a brand new player. But the bottom line is that I'm not surprised in either which way because I don't know why he would be going to Chelsea at this stage in his career because you're going into an environment where there are so many players in a similar position. So he's in a situation where I don't think he would have gotten into Chelsea's team as a matter of course as a starting line-up player so he would have been part of a squad. He is a very good player, he's a long way away from being a world beater but he's a very good player and I'm not surprised that Palace have been able to engineer, Dougie Friedman is a very capable operator and so he would have been spending an inordinate amount of time making sure that this boy was listening to sense. My view, this time next year he'll be gone but right now in the here and now because obviously Roy Hodgson was very unhappy and almost speaking out of school about what he was sold in terms of taking on the job against what he may be left with which was certainly the disappointment of accepting Wilfred Zahal going out the door but no acceptance of the fact that someone else was going out the door. But what's your take on Palace seemingly got into a mood that they're going to tough it out with Chelsea because there were reports that Chelsea's pursuit of Alisi had aggravated Palace officials. They thought a line was crossed in the conduct regards attempting to sign a player, you now know what that means. Whether it's true or not, get onto Alisi, see if he wants to join us, get into his head, see if he wants to come to Chelsea. I don't want to pitch it into another one of my broadsides of the media but sometimes what the media report in terms of the characterisation of a deal are often vastly different. When we got relegated from the Premier League I was told emphatically through the media that Andrew Johnson was gone and he was nowhere near gone. He was nowhere near across the information, it was somewhere, somehow they often fly a kite and if that kite goes somewhere then actually they look like they've been very intuitive and often it doesn't. You know I think it was maybe one of Johnson's representatives. It may well be, it may well be that they're utilised but that's not the same thing as having an integrity behind the actual information, that's the media being utilised by an agent. That's the media being used as a conduit for an agent to achieve an outcome. And in this instance what you've got is a player, they had a £35 million release clause and Palace really have done what they should have been able to do. They've got the boy in the building, they've got him under contract. Now of course the release clause causes them a problem, that's the problem that they've got which is the release clause causes a challenge which takes it out of their hands. And somehow or another I would imagine by a series of sensible thinking, structuring a new deal which gives them... Would you have wanted more than £35 million as a release clause? Well if I'd have wanted more than £35 million as a release clause I should have stuck it there in the beginning shouldn't I? The point is that I've got what I've got. Now what I've probably got is a bigger release clause. I've now got the ability to go into the player, give him a nice little pay rise, give him an understanding that if we get a deal this time next year that's more in keeping with what Palace would like to see their players valued at, that he will have the opportunity to go again, he's going to play on the side, he's going to play regularly, the team's going to be half built around him being a mainstay and all of those things will give this young man an opportunity to be an even bigger catch in a year's time. I mean it's a good point, I mean Rob one of the listeners is saying Simon will there be a new release clause in the contract? Well there will be and there will be more than £35 million. I would have thought so. But you still think it will go this time next season? I would have thought that Palace would have engineered something that gave them a little bit more traction on a bigger price tag but not too much that the player didn't want to sign a new deal with them because if Palace suddenly turned around and said we want an £80 million release clause then that's going to be a deterrent to lots of other football clubs. But also these wages would have been transformational wouldn't they because there were reports that Zaha was the one player that was earning over £100,000 a week at that football club and I think maybe Elisei was taking over that contract. He was on £130,000 a week and when his contract came to expire Wilfred there was an offer of significantly more than that because the cost implications of replacing him in a transfer fee didn't make the sense commercially. I mean the dial has switched actually Simon to earlier in the week when we were putting it out there to Palace fans. Now listen of Zaha, Elisei and Ezei which of the three would you be least bothered about? I would have thought Zaha would be the answer here and he's the one they've lost. They're going to hold onto Elisei and they look like they're going to hold onto Ezei so it's not bad. But Zaha was priced into their thinking a while ago because they knew he was coming into the last year of his contract. They would have known for some time that it was a distinct possibility that Zaha was going to be going. But he wasn't a future. No but he was a very good servant for the club. And neither was Elisei. He played over 450 games for Palace and you could say he carried the club for a long period so let's not be disrespectful of that. Absolutely. I mean the amount of contribution that he made to that football club from the day he stepped back in the door in 2013 to the day he left. Never got his big move though. In the English Premier League never got his big move. Arsenal never happened. Well you say that. He went to Manchester United didn't he? As a kid yeah. But then maybe that created some question marks and he felt maybe that he wanted to stay and he was a very good servant for Palace. I mean the tragedy for Wilfred Zaha is that when he moved to Manchester United he was Alex Ferguson's last signing and the change of culture at Manchester United he got caught in the crosshairs. Now I don't think he went up there in particularly the right frame of mind and as professional as he could have done and if he'd have gone two or three years later then we would have seen a different outcome. But there was no doubt in my mind not just because the boy came out of my academy and I've known him since he was a young man but because I know the talent. And the only reason he didn't go to Arsenal was because Palace wanted to hold the line. They wanted £60 million so Arsenal went and bought Nicolas Pepe for £70 million. Talk to me about that conversation compare and contrast because Zaha would have done a significantly better job. Yeah but if they really wanted him they would have gone to that money. Well the reason why they didn't do that is because they really wanted Declan so they went to that money. Different timing, different outlook. Maybe it was Suo who was in charge of recruitment at that point. It was also at that time because Arsenal were able to pay Pepe on the drip. They were able to do a deal or they could pay it over four or five years. I've forgotten about him. He had a cost implication whereas Palace would have turned around and said you won our best player, you pay for it, you pay top money for it, you pay it on the nail. And now the culture has changed. Ever since the European Super League the attitude from Stan Kronke has been completely different. Completely different. Hey I'm Ryan Reynolds. At MinMobil we like to do the opposite of what Big Wireless does. They charge you a lot, we charge you a little. So naturally when they announced they'd be raising their prices due to inflation we decided to deflate our prices due to not hating you. That's right we're cutting the price of Mint Unlimited from $30 a month to just $15 a month. Give it a try at MintMobil.com slash switch. New activation and upfront payment for three month plan required. Taxes and fees extra. Additional restrictions apply. Payment at MintMobil.com for full terms. Martin as we look ahead to this big weekend of course it's a huge game. Manchester City against Newcastle and it's only the second weekend in. I look forward to going to it. But already even two weeks into the new season and straight back of course from Athens where they won the Super Cup the other night against Seville. Pep Guardiola has been bemoaning the Premier League schedule. Have a listen. Not one drop of alcohol today. Recover as much as possible because again from Greece thank you so much for the Premier League to let us play on Saturday and not on Sunday on Monday. Thank you so much. So he's having a bit of a swipe at them there. A bit sarky there from Pep. But then to the written media he's saying it sucks. This is on Kevin De Bruyne of course he's lost him. He's a very very special player to Manchester City. And he says he has a distinct talent. His connections with Hallan. But it is what it is. My first pre-season I had 25 days to prepare for the first official match against Contor Riga to qualify for the Champions League that we eventually won. Now they give you four, five days and look at how many ACLs injuries that we have. Now he then goes further Martin and this is where it gets into your territory and I'm sure you'll want to contribute here. He says you go to Asia to the United States really tough matches, derbies, big games, people fall they keep falling because the show must go on. If Courtois isn't there, of course he's out injured, someone else will be there right. If Militao isn't there, he's now out injured, someone else will be there. If Kevin De Bruyne isn't there, someone else will be. This is a lost battle unless the players themselves stand up for themselves and they say we're not playing. So he says it's a lost battle Martin, nothing UEFA or FIFA will do. He says he's crying out for them to get involved. Does he more than ever have a point? Or should observers just be saying pet? Get on with it. Jim, this is one of the greatest managers we've ever seen in our game and obviously tactically quite brilliant, a real thinker of football. He feels that these wonderful players have been lost to our game because of the workload. We have to listen, we have to listen. Look, this is not a Punch and Judy show that we run here and this topic comes up so that me and Simon can pro-punches at one another. That's the way you do it. Because to be fair, I'd probably put him to the ground if I did that, but I'm not going to throw punches. Maybe verbal punches. You just love that, watching live on YouTube and Facebook. And then we'll see who the real boxer is. Punch, Judy. Jim, De Bruyne is going to be denied the view of watching De Bruyne this season. Sorry Punch. He's out again. He's down to the workload. He's going to have to have a lengthy break. But okay, I look at that and I think, well okay, the other night's super cup, he didn't make one change in the game. I think it was the last five minutes. So whether he was using it now, the super cup, almost as pre-season, that's kind of looked like that to me and burning conditions, wasn't it? Really hot game affair. And you look at his bench and he was very much looking to the weekend and he might have thought he could have had a Sunday game. If he's playing the super cup, he's representing the Premier League. I don't understand why it was the Premier League didn't want to then give him a little bit extra time for the match. But Martin, the more games you play, the more successful you are, the more games you play. Yeah, 100%. And that's the issue. And the more money you make, the more money you make. But we've said it many times before, haven't we, about the number of hours between fixtures. This is probably borderline. Then the stage of the season. And Jim, he's let Gundawang go, he's let Mahrez go, all players he wants to let them go and fulfil one at the end of his contract, another one coming in for lots of money. So I think it needs to be looked at and the players, he wants them to stand up for themselves. He's doing the talking for the players. He's trying to do that within his club, and let's hope in the future, then things change slightly. But these games are very lucrative in pre-seasons. I'm looking at Manchester United Arsenal, I think we're making sort of £17-18 million from a pre-season trip is quite remarkable. So the club doesn't want to turn that down. But at the same time, the manager then has to protect the players from the heavy workload. And the other night Pep wasn't able to do that or felt he couldn't do that because of the early onset of the game. To be fair, Sam, the calls about this are growing, you hear from Guadjiello on it. We heard from Goran, we heard from Rodri. Listen, I find it a bit disconcerting that the only time Martyn wants to have any sort of physical obligation with me is when I'm recovering from a serious illness. I think that's slightly disadvantageous. Did you notice that? I never mentioned it before. I was joking. Why do you want me to be ill and now he wants to beat me up? You can be sure I was joking. Hit a man when he's down, which absolutely. You hit him when he's down. But the point is, there is a trade-off, and I understand the arguments, because no one's suggesting that the player shouldn't have a view and a balancing conversation about how we can find a solution. But not one single person is coming up with that solution. The only solution is step down the amount of games. Now, the consequence for stepping down the amount of games is that there is an economic blowback. And if everybody's happy to have that economic blowback and prices it into their thinking, then maybe the argument can rage even more significantly. But they're not. It's a one-way transaction. All the upside. We'll take all the upside. But when it comes to the fact that there is a consequence to the upside, that conversation doesn't want to be heard. And there was a battle going on in football. And the reasons why this is becoming louder and more facilious, and what's interesting about the referees and their desire to push back on the time-wasting is because there's a battle going on about who runs football. The players now are beginning to believe that they run football, that they ultimate control of football. Rather than be the protagonists and beneficiaries of the outcomes and the star and the talent, there is this battle raging now about who runs football. Hang on, Simon. FIFA and UEFA run football, but they don't want a reduction in games because they don't want money to drop either. And the reason for that is what? The reason for that is what? Because the nature of the game and the economics of the game and the scale of the game have reached such a point that there was a need to generate as much revenue as they possibly can for all the different facets. Now, the FIFA staff, you know, I'm not in the camp of wanting World Cups every two years unlike his cult leader. I'm not in the ideal that there should be FIFA World Cup championships that need to have more games for the FIFA World Cup championships. I think there should be international football, international football alone. But when we're talking about domestic football, put aside the international framework and look at the domestic football. The players are not interested in telling you what they will do. They're only interested in telling you what they won't do. They want to sit at the table, not because they want to provide a solution. They want to tell you that they don't want to play in these games, whilst taking all the benefit of the economic returns that these games bring and football brings. Now, if there's a discussion to be had, which is ultimately we're going to cut our cloth accordingly, the ship is sailed. They're not going to. And the reasons why I make the slightly long-winded point, because the game is beginning to look at things in a certain way and look at the reality of what's going on. We're seeing players be going over to Saudi and people suggesting that players are going to be the reasons why the Saudi League is going to be successful or unsuccessful. And this battle is raging about who and how football needs to be run. If they don't like it, I tell you what, have the balls then. I double dog dare you. Go out with FIFA Pro and go out and strike. See how you get on. If it's that bad and you really believe that you're the victims of this awful situation where you're being put under undue pressure and you're being pushed to a level, but you won't because you've got such a wonderful opportunity from the business of sports that the consequence of it is, is tragically managers have got to rotate. So you're asking for strike. You're not asking for consultation. You're asking for strike. But people don't want consultation. No, the players do. That's what you're missing. The players don't want consultation. They want to go into a room. They want to be consulted at the very least. They want to go in a room via their agents, via their unions, because they're not going to go in. You're not going to wheel in hundreds of players, are you? You're going to wheel in their... We don't want this. We'll take all of the upsides. We'll take none of the downsides. So they only want to go in a room and tell people, we don't need to hear that. We all know that you don't want it. How do you know that if you don't ask the players into the room? They've not asked the players into the consultation. Mark, to finish this, looking at it realistically, is it a matter of time do you think we'll have a high profile player in the Premier League saying, you know what, I'm not playing on Saturday? I don't think you can do that, Jim. You can't. Well, these are the noises they're making. You let your flans down. You let your colleagues down. I think all they're asking for the fixture list to be altered. This is another call to arms from Pep, isn't it? He's saying to the Premier League, look, we're coming back from playing this game in the Super League or the Super Cup game. Could we please have had another 24 hours and no one's listening? The reason is why? No, everyone's listening. Because they needed to prepare, didn't they? They wanted to protect. No, hang on a minute. Because you hear that. They were proud winners of the Premier League and they now feel they've got one of the most difficult games of the season. So your version of listening is acquiescing, yes? So I've listened, I've heard you, but no. Right? Unless you listen and act, right? And ultimately there must be a reason why they're acting or not acting in this instance. It's not because they just want to cock a schnook at Pep or they want to put a thumb in his eye. They just, there must be a really good reason and I suspect it's probably to do with broadcast revenues. I suspect it's probably to do with broadcasters. If you don't like the broadcasters, well, I'm sorry, they're the guys that have put football in the position that it's in. And I do find it, not because I want to be on the other side of the argument for you and as you quite rightly say, have a Punch and Judy show, but the bottom line is, is that it does make me laugh when I listen to people like Bernardo Silva that sit there with all the benefits of football. If you'd have asked them 10 years ago, tell you what I'm going to give you. I'm going to give you 10 million pounds a year, but you're going to have to play a lot more games. What would you do? He'd have pulled your arm off at the shoulder. Now we've got a narrative, which is basically empower the players. A player's opinion needs to be brought to the table. You want to blame the players, don't you? Every junction. Your 100% essential down, Outspoken with White and Jordan. Thanks for listening to Outspoken. Don't forget to leave a five star review and subscribe so you don't miss an episode. We'll be back on Monday. We all have tasks we'd like to avoid, like mailing and shipping. It takes time lugging all those letters and packages to the post office. That's why you should try Stamps.com. For 25 years, Stamps.com has made mailing and shipping easy. You get all the services of the post office right on your computer, anytime. No traffic, no waiting, no hassle. Plus, you save money with discounts up to 84% on USPS and UPS. With Stamps.com, all you need is a computer and printer. Print stamps, print shipping labels, and if you sell products online, Stamps.com connects with every major marketplace and shopping cart so you can spend less time on shipping and more time on your business. Get started with Stamps.com today. Sign up with promo code PROGRAM for a special offer that includes a four week trial, plus postage and a digital scale. Just go to Stamps.com and enter code PROGRAM."}, "podcast_summary": "In this podcast, host Jim White and Simon Jordan discuss various topics related to football. They first discuss the future of England's women's national team manager, Serena Vigman, and whether she could eventually take charge of the men's national team. They also talk about Crystal Palace's ability to retain player Michael Ulysses and the topic of player welfare in football. The hosts also touch upon the recent comments made by Mark Bullingham, the chief executive of the Football Association, who expressed his support for Vigman potentially managing the men's team in the future. There is disagreement among the hosts on this issue, with Jordan arguing that the men's and women's games are different and that the best person for the job should be chosen based on merit. Overall, the conversation highlights the ongoing debates and discussions within football regarding gender equality, player welfare, and the future of the sport.", "podcast_guest": {"name": "Simon Jordan", "org": "TalkSport", "title": "", "summary": "Simon Jordan (born 24 September 1967) is an English businessman who made his fortune in the mobile phone industry. In 2000, he purchased Crystal Palace Football Club and remained chairman of the club until administration in early 2010. In 2002, he co-founded and funded the car magazine Octane, selling his 50% shareholding in 2006. In 2006, he opened the restaurant Club Bar and Dining in London's Warwick Street, Jordan sold it to the Ottolenghi Group in 2011 who renamed the restaurant Nopi. Jordan is currently a co-presenter on the weekday mid-morning sports programme TalkSPORT , White and Jordan.\n\n"}, "podcast_highlights": "In this episode of \"Outspoken with White and Jordan,\" the conversation revolves around several key topics. Firstly, there is discussion about the possibility of women's football manager, Serena Wiegen, taking charge of the England men's team in the future. While some believe this could happen, others argue that the men's and women's games are different and should be enjoyed separately. The conversation also touches on the recent contract extension of Crystal Palace player, Michael Elyse. Despite interest from Chelsea, Elyse has chosen to stay with the club. This decision is seen as significant for Palace, as they retain an important player and can continue to build their team around him. Finally, Pep Guardiola's comments about the demanding schedules of Premier League football are discussed. Guardiola argues that the fixture congestion is leading to more injuries, and calls for players to stand up for themselves and refuse to play excessive games. However, there is a counter-argument that reducing the number of games would have economic consequences for the clubs and governing bodies. Overall, these conversations highlight important debates and opinions within the world of football."}