{"podcast_details": {"podcast_title": "The David McWilliams Podcast", "episode_title": "Poland rising", "episode_image": "https://assets.pippa.io/shows/61b9fedc1a8cbefa383cf076/show-cover.jpg", "episode_transcript": " Now, some people like ads, some people don't, and that's okay. But we like to keep everyone happy. So if you're one of the people who doesn't like to listen to ads, choose the David Mac Williams Plus option on Apple Podcasts. And you can listen to this podcast just the way you like it. Think identity theft won't happen to you? Think again. There's a new victim every three seconds in the US. Over 15 million this year alone. And many don't even know they're victims. LifeLock alerts you to identity threats you could miss, even when you monitor your credit. If your identity is stolen, your dedicated US-based restoration specialist will work to fix it. No one can prevent all identity theft. But everyone can save up to 25% their first year at LifeLock.com slash Acast. Identity theft protection starts here. Who's exhausted by social media these days? eHarmony's new Dating Diaries study found even 56% of social first gen Z gets tired of social media. When it comes to connection, we want someone who truly gets us. Not just online, but offline too. That's why eHarmony is different. Their compatibility quiz connects people looking for real love, and helps you match with someone who will truly get you. eHarmony's process makes finding a connection genuine, not exhausting. So join the dating app that helps you find someone who gets you and see for yourself. eHarmony, get who gets you. Start free today. To understand the economy, you have to understand human nature. This podcast is powered by Acast. How are you doing there? It is podcast time. It is high summer. It is high summer, John. And this podcast is going to be a continuation of our European tour, John. But we're going to go to Poland. And for a variety of reasons, we're going to go to Poland. Fascinating huge country. But maybe one of the things that's always interested me was the fact that since 2001, 2002, Ireland has received in probably more Polish immigrants per head than any other country in the world. The stonewashed jeans. The stonewashed jeans, exactly. Exactly. And at the peak, just after the Celtic Tiger boom, because the Poles were involved in the building trade in the main. And there was actually even a character in the French election called the Polish plumber because the French didn't allow. It's an amazing thing. Ireland, Britain and Sweden were the only three countries that allowed Polish people to travel and work without visas. Yes. In the beginning, Germany and France didn't allow Poles to work, even though they were in the European Union, because they were afraid of the impact on tradesmen in particular of Polish tradesmen coming over. So they were not going against the EU agreement? It was a caveat that France and Germany sought to insert because of the fact that Poland was a country of 38 million and Polish immigration could have an adverse effect on the wages of tradesmen. Whereas in Ireland, we were in the middle of that building boom and we just needed workers. So we absorbed them in. So for example, even today, John, even today, 17% of the population of Mill Street, which is a North Cork, are Polish. That's one in five. And the other thing about Ireland is that the way in which the Poles settled is they settled all over the country. So they didn't just settle just in Dublin. So what you find is large Polish communities. If you really want to know where there is a Polish community, you have to look through the Polsky Shlep. You know the shop. Yes. So all over the country in Ireland, there are Polish people. And yet we don't know that much about the country itself. That's true. And again, you know, maybe we should. I've always thought that all these immigrants come into Ireland, their greatest, greatest value to Ireland as a nation, as an economy, are their networks in the places they came from. The hardest thing to do is to do business in a country where you don't know the culture. Yeah. Whereas in Ireland, we have so many Poles. We have so many Romanians. We have so many Spaniards, as we talked about last week, with so many Italians. We should be able to, or the state should, realise that this is part of our human capital. This is part of our network. And you know, one thing that struck me, not only could we or should we regard these immigrants as actually salespeople, an Irish sales force selling Irish products abroad, but also culturally, I've always thought, why don't we just give an option? Why don't we just give an option in school to learn Polish, employ Polish primary teachers? There must be loads of them. Absolutely. But that's a brilliant opportunity for us, because we are notoriously crap at languages. It's embarrassing, actually. It is embarrassing. And kids learn languages from other kids. That's what you notice, right? If you're in a school, I don't know, Dunmanway and Cork or Kerry or Galway, and there's a whole lot of Polish kids who are speaking Polish at home. Yeah. Right? You know, give Irish people the chance to realise that there is a world out there and learning languages is part of a process of cultural simulation. And nobody ever lost out by learning a language. In fact, there's an incredible amount of studies, scientific studies, that kids that are bilingual are able to absorb all sorts of other information much quicker, because there's pathways formed in their heads, the synapses kicking up in their heads that actually allow them to absorb all sorts of things. So, you know, that idea, I always think that we're kind of static in the face of immigration. And you've got to see, immigration is an opportunity to do all sorts of things. And learning languages is one. And speaking of learning languages, John. Speaking of learning languages, as these last few podcasts have been an Irish person's tour around Europe, we're going all over the place and we're thinking about languages and culture and simulation and all sorts of good stuff. There was a great example last week of Ronan O'Gara's team talk to Lara Schell, in French, but with a very Cork accent. How do you say Cork people in French? Corkoise. Languere. C'est incroyable. C'est incroyable. Ecoute ça. Listen to it. C'est pas possible. L'opportunité c'est fucking énorme. Mais on commence aujourd'hui à zéro. A zéro on va créer l'énergie, le te-des-pris, le sacrifice, tout ce que je veux faire. Well, just trips off his tongue. So Ronan, I'm telling you, inter-cert French, leaving-cert French, it was a bit like, John, I bet your French oral was a bit like that. Oh, totally. Totally. I'm on the Duolingo at the moment, by the way. Are you? I am. Learning French. I'm telling you. I've just got the accent bit. I have to work on the words. Well, you know, it's funny you think about the accent and this is going out to Ronan O'Gara. When I was learning French years ago, I went to college in Belgium and the actual Masters was half in French and half in English. My French was really bad. I didn't even do French for my leaving-cert. I did Latin instead, which is a ridiculous thing, right? And somebody told me, and it was a really good piece of advice, if you want to learn French and if you want to speak French, do exactly what you're doing there, John. Exacerbate, amplify the Frenchness, you know, over-pronounce everything excessively. So you sound like Inspector Clouseau, right? If that's the objective. And they said it actually works and it does. So, you know, what you do is you try to actually envelop yourself in all things French and you sound extremely like that. And Samar-sha. You know, back in, was it 91 or whatever, I spent a summer in France in Clermont-Ferrand recording an album and I had no word of French when I started. And by the end of the album, like two months later or two and a half months later, I was talking high technical stuff in French. Oh my God, I was amazing. But I was just immersed in the whole thing. Well, no, it's true. It does get you. Well, listen, actually, I want to go back to John's summer in Clermont another time. OK, in Le Massif Central. OK, but let us go. Let us go. So listen, Rog, thank you very much for that. That was impressive. Unfortunately, it was a team talk for La Rochelle, who obviously kicked Seven Shades out of Leinster at the very end last year. So we best forgotten that. And I'm sure a monster man like Rog was, it was a double victory for him. It's a double victory. Now, let us go. This week we're talking Poland, John. And a couple of weeks ago, I went to Poland. You remember this on my way to Kiev in May. And what I did in Poland was, you know, the way this idea that I like doing is I like going, if I arrive on my own in the city, going on cultural tours. And I went on a tour. If you're ever in Warsaw, there's a website called withlocals.com, which is basically an off the beaten track tour. Right. So you're you're not going to see. I mean, the Warsaw ghetto is very, very impressive and the old town is very, very impressive. But this was actually, you know, a slightly different tour. I call Marcin. It's called withlocals.com if you're ever actually over that neck of the woods. And it was a tour of Prague, which is a sort of a newish suburb, a sort of 19th century suburb. A fascinating story. So I got really deeply into Polish history for about, I don't know, about three and a half hours, which now I've decided I'm an expert. And then I then of course, I got the train to crack. New there. Exactly. I got a high speed train to crack off. OK, number one. I thought, wow, this country, you know, and then I got the train onto a place that's impronounceable. I think old Premichel. But luckily, our next guest will be able to pronounce it because many years ago, as you know, I worked in the emerging markets, which is the neck of the woods for that Swiss bank UBS. And it was like a sort of a circus of all sorts of oddbods thrown together, people with very eclectic interests in the world, people who could speak Slavic languages better than they could speak their own, all that sort of bizarre thing. Right. All sorts of different refugees from all sorts of different places. And one of the lads who rocked up was an East European devotee, obsessive expert, James Oates, a Scotsman. He turns up and of course we killed it off like that because the Irish and Scottish thing straight away. James now lives in Tallinn, but is on the board of a number of companies in Poland, knows Poland back to front has been stomping around that world for at least 20, maybe 35 years. Fair to say, James, is it? And it's great to see you. How are you, James? I'm not so bad there, David. Yeah, it's a good 35 years and it's Premichel. So, you know, Premichel is the name of the town. Premichel, yeah. I mean, and if you think that French needs a wee bit of an accent, yeah, Polish has the same problem. And you basically need to go psh psh psh psh and that will work it out. Psh psh psh psh. John, you might remember, you might remember James who was at our wedding. Yes, indeed. Not our wedding, John, you and me. The only man in the kilt. The only man in the kilt. In Ransko, that's it. Yeah, yeah, yeah. The only man in the kilt. James, let's talk about Poland, right? An extraordinary country. Give us a little bit of the history in the sense that the Poland we know today geographically is not what Poland was 100 years ago. Well, that's right. I mean, I once went to an old museum in London run by the government in exile. And the captain who was showing us around the exhibit said, you have to understand that Poland has not really got foundations. It's built on roller skates. So it kind of moves, it kind of moves around and it does. And, you know, it's been as far east as Moscow, more or less as far west as it is now. So it has moved around a lot. And in particular in the 20th century, I mean, first of all, it disappeared completely after the partitions of Poland in 1795. And so there was what the Poles call the three kingdoms. It wasn't a Polish kingdom. There was an Austrian Empire, Prussian Kingdom and a Russian Empire. And actually, the weird thing is you can still see the borders today. So it was divided up and then it had to come back together again. And it's it was quite a multinational place. I mean, you've got people who came from what is now Ukraine, who were extremely Polish, but they were all chucked out in 1945. Every last one of them. And they went to what was Germany. So cities like Danzig or Stettin or Breslau suddenly became, well, once again, in the view of some a thousand years of Polish history, Stettin brought off Gdańsk. And so they literally brought with them the statues from the cities that they were expelled from, which is what we now call a Wulff or Vilnius. So these are big Polish populations and they moved around a lot. And Poland was a multinational country. And now it isn't. It's a massively completely Polish country. Now, some of that is to do with the fact that, you know, the very large Jewish community was murdered. But also, you know, the Germans were expelled and the Ukrainians were expelled and the Poles were expelled from Ukraine, Belarus and Lithuania. So it is a country that moves around a lot. So what we're talking about is a country that when geopolitics shifts, Poland shifts. Yeah. And it can move west or east. And the Polish people who used to live in Lvov now live in Poznan or what used to be called Breslau. Yeah. And those German people who used to live there now live in West Germany in the main. And the Ukrainians who are now living in Lvov, where did they come from? Well, they came from the countryside around Lviv. So what really happened was that the cities and towns in that area were Polish speaking. But the country districts weren't. And that's why Stalin decided, no, this is going to Ukraine and Belarus. So it was a massive patchwork. But now it's not. And that's the extraordinary thing about Poland. It's gone from being this sort of very multinational, multilingual, multicultural and multi-religious also to being basically Catholic, full stop and Polish, full stop. And in a weird way, some of the national questions of Poland mirror those of the Celts, especially of Ireland, because you've got a kind of political struggle that was backed by the church against, in the case of Poland, most of its neighbors. And so you've got a whole wacky history, which is, as you rightly say, it's geopolitically driven. But things have changed quite a lot because Poland is not a small place, as you find out. I mean, it's got 38 million people economically. It's been growing incredibly fast for an amazingly long period of time. So it's gone from being a pretty screwed up place that was still toiling to integrate the different parts of the country from 1945. And it's ended up now with new infrastructure, a whole redesigned economy. And it's really quite a modern place. You know, it's kind of the eastern side of Europe's answer to the to the tiger. This is what I want to focus on before we do that, before we focus on the economics, I want to talk about the sort of sociology of the place, because those borders have shifted. But people's attitudes remain the same in terms of what was conservative and what was liberal. Explain that to me, because that is kind of fascinating. Well, yeah, I mean, you can literally see from voting patterns where the old German territories were, because they're the ones that tend to trade with Germany. The population may have come from the East, but they've ended up being more integrated into the West and they're more dynamic economically, whereas the eastern side of the country, which is under the control of the more nationalist party, is still relatively speaking, it's more backward. So the infrastructure that was left behind after the borders moved, it's being integrated and it is being modernized across the board. But you can still see where the boundaries were. I mean, I occasionally drive down there and there's an area which is now finally being dug up. But you can you can see where the cobblestone stop and tarmac begins. That was the old German Russian border. So, you know, it really is an incredible thing. And yeah, the attitudes are on the western side are funnily enough, more western. And that's where the economy has been more dynamic. That doesn't mean that the eastern side is not dynamic. It's just dynamic in a different way. It's still more agrarian. And of course, you know, the reality is if you live next door to Germany and you're exporting to Germany, you know, you grow faster than if you live next door to Ukraine and you're exporting to Ukraine from Chemishil. Chemishil where I spent a long time and actually I was writing about the interesting thing about in Chemishil, you've got to wait for this train to Kiev. What really struck me because it was obviously all Ukrainians and what struck me about displaced people, you know, there's a lot of absolute trauma and inconveniencing. But somebody asked me what it's like to be. And I said, the thing that strikes me most about displaced people, I won't talk about Ukrainians, is the waiting, waiting for trains, waiting for buses, queuing up to get a visa, queuing up to get an entrance visa, queuing up with a passport control. You have no kind of sovereignty over your life. You're dependent on other people like the UN, HCR, we're at the border and everything. That just struck me that that's one of the things when people are displaced, one of the powers that you lose is that ability to control your own life and control your own world. And I'll talk to you about that in a sec. But let's talk about this dynamic economy. So I arrived in Warsaw, go to bed, wake up. I haven't been to Warsaw for about 25 years. My God. And I am in an extraordinarily dynamic city. Explain to me what's going on in the economy because it is growing. We have now 130,000 Poles in Ireland. We had at one stage 250,000 Poles in Ireland. Most of them have gone back. Tell me why they're going back. Tell me about the economy they're going back to. Well, they're going back to an economy that has continued to grow for 27 years. It's never actually been into recession all that time. So the economy is now six times larger, nearly seven times larger than it was in 1990. And that incredible growth rests on the creation of a service sector and modernization of infrastructure and the development of really good up to the minute industry. Now, you talk about the refugees. There are three million Ukrainians in Poland right now. I mean, you walk around Poland and you hear Ukrainian or Russian. And they're as often as Polish in some places. But they've been able to bring them in. So there's a real determination to support the Ukrainians because their view is, well, that'll be a great opportunity for us when the war is over. But the economy rests on Leszak Barysiewicz. Barysiewicz, he chose a radical transformation. So what Poland did was they didn't try to do it smoothly. They just basically went straight to a modern economy as quickly as they could. They privatized quickly. They solved a lot of their labor problems quickly. And yeah, quite a lot of the pressure actually that could have come from unemployment was relieved by the fact they all turned up in Britain and Ireland because they were the first countries that allowed Poles to travel before they joined the EU. And so the combination of the EU, of investment, of a really dynamic investment environment. I mean, when we first went to Warsaw, I mean, there were three tower blocks. There was the Stalinist wedding cake, the Palace of Art and Culture. Which is still a gorgeous look at the, was it the Dom Kultury, isn't it? The Paweł Sienkiew Kultury. And it's got a clock on it now, which it didn't have before. So they modernized this thing and it had a couple of other things. And, you know, there was the Brigada Mariacki, the guys who stayed in the Mariack Hotel, which is kind of next door. And opposite that, there was the Electron Building. So three sort of tower blocks. Now there's probably over 200. I mean, as you saw, I mean, you know, you've got something that looks like a Midwest American city, especially because Warsaw is on a flat plane. You can see it for miles. And the incredible numbers of new towers. And that's reflective of a real dynamism. These guys have actually, they know how to work and they're not frightened about work, as I think a lot of people in Britain and Ireland know very well. So they made a wee bit of money in Ireland. They brought it back. They've not just bought houses, they've set up businesses. So there's a real sort of entrepreneurial spirit that the Baselorowicz plan released. And that's why it's so exciting. And it's pretty incredible when you look at the numbers. I mean, as an economist, you'll know that all the numbers are lies. But the truth is... And as I always say, every statistic has an agenda. Yeah. And the issue is, of course, you've got now motorways and they don't lie. You can't interpret whether a motorway is there or not. So you've got, you know, it's noticeable when you cross the country coming down from the Baltic towards Germany, you've got brand new highways. And then you get to Germany and they're not brand new. They're kind of twisting, kind of scary. So they've really jumped a generation in terms of infrastructure, and that's including telephones and internet and everything else. So they caught up with what Western Europe was doing. And in some places they've overtaken. Yeah. It feels like that when you're there. It feels that this is a country that has skipped a generation or two in terms of development. Yeah. It needed to though. I have grainy memories of the imposition of martial law in Poland in 1981, I think it would have been, around Christmas time. I've also, a lot of Irish people have grainy memories of John Paul II being Polish. And that seemed to be significant at the time that he was Polish. Lech Walesa was also... These are kind of generational memories. But the idea, the country that I visited the other week is extraordinary. And there's one thing that really struck me. One of the themes of the last couple of weeks traveling around Europe has been certain countries have managed to still have substantial cities outside of the capital. And it seems that the Poles have that too. They have, you know, it's not just all Warsaw centric. They have a lot of big cities which are very autonomous. Yes, they are. I mean, it is quite a dynamic environment away from Warsaw. You mentioned Lech Walesa and of course Walesa kind of gave Balcerowicz the mission, should you choose to accept it. He said, I want you to turn fish soup back into an aquarium. That's what he said. That's what he said. And this line has been used a lot. And you see they broke up the state bank, the Narodowy Bank Polska, the National Bank of Poland, into local banks. So there was a bank in Dysk, in Wrocław, in Szczecin and so on. And the one in Poznań was bought by AIB in the end, Wrocław Polska Bank Kredytowy. Yeah, with our tax money. Thank you very much. Yeah. And thanks. Thanks, Arda, for that. It was great. And the message, though, actually, it worked out pretty well for AIB. I mean, Arda, not so much, but Poland very much so, because the reality was the growth of these places was really rapid. And so you got people locally who were able to make really quick decisions and they did. And, you know, you didn't have to muck about. So Poznań particularly ended up as one of the wealthier parts of Poland these days. And it's the home of one of my favorite beers, Lech Beer, not named after Václav, but, you know, hey, it's still worth a drink. And it's only a stone's throw really from Germany. I mean, it's only about 100 kilometers or 50 kilometers from Frankfurt and Oder. Yeah, I mean, you can get there in an hour. So, James, let's say so. There's Poland from 1990, let's say, to 2022, February the 24th. And that Poland was a big central European state in NATO with a well-behaved neighbor called Germany on one side, a slightly complicated relationship with Ukraine on the other, a reasonably well-behaved Russia just over the border again, past Belarus. Then on the 28th of February last year, that all changes. Poland is now at the fulcrum of a European war. Explain how Poland, how this has changed Poland and will change Poland for at least the next decade or two. Well, sociology is kind of interesting because when you get three million refugees turning up on your doorstep, you can either go kind of negative on that or you can go positive. And Poles have gone really positive. They've welcomed the Ukrainians. They've supported them. Actually, you don't need a visa to cross into Poland. So although it's the usual chaos of borders, the reality is... Don't worry, I've done it twice. I've done the five hour wait in the bus. Yeah, awful. Yeah, I mean, remember borders. What a thing. So the sociology of Poland is that it was moving in quite a dynamic economic way. But there's also issues in terms of social policy, particularly the church was was quite sponsoring of populists and of the political spectrum. Explain to me where this comes from, because I don't think... And again, it's one of those things you always see that if you have economic growth, if you have a higher standard of living, these tend to go together with the cocktails that biases itself towards liberalism, right? And tolerance and openness and all this. The Poles have gone the opposite way. So Catholicism is back. If you thought Catholicism was gone, it's back in big way. It's very much enmeshed with the ruling party or the party in power. So explain that before we talk about Ukraine and geopolitics, explain that sort of conservative, liberal, urban, rural divide in Poland that we see so evident now. Yeah, I mean, in a way, Polish politics kind of mirrors some of the things that you used to see in Ireland, because you don't really have a liberal party as such. You have a kind of social nationalist party, which is the piece, the current guys. And then you've got a kind of liberal conservative fraction, which is the Civic Platform, which is now forming a little coalition with the Greens and calling itself the Civic Coalition. Now, those are the guys who wrote the original economic plan. And those are the guys who became big heroes in the EU. So Donald Tusk, who was the chairman of the European Council, was the longest serving prime minister of the Czech Republic. So since 1990. Now he's back. And in the interim, the social conservatives, the nationalists who are in government, have done several things that have created a lot of social tension. And one of which is to really restrict abortion and to be very negative on LGBT rights. The other is that they have actually tried to attack the judiciary and have been somewhat successful in that. So there is a big dispute at the minute between Brussels and Warsaw over how the current government has approached what they want to call judicial reform and which a lot of people want to call judge nobbling. And in the middle of all of this, suddenly there's a war. So there was a concern, actually, that the nationalists, like many nationalist parties across Europe, were actually closer to Putin than you might want to think. Well, actually, Mateusz Morawiecki, who is the prime minister, has been absolutely onside for Ukraine in most things. I mean, they tried to save their farmers by stopping the import of grain into Poland. That's created a bit of tension. But other than that, I mean, the Polish defense spending is now at three percent and rising rapidly. And the thing is that the Polish army is actually a really good one. I mean, a lot of people have got a bit nervous about the Belarusians flying their helicopters over Polish territory. I'm here to tell you now, if there was anything serious Belarusians try, the Poles would be in Minsk in a few days. The Belarusian army, even with the Wagnerites, isn't going to cause any trouble for the Poles. They comply with everything NATO. They've got a really good kit and they've got a fighting spirit, which terrifies you if you get amongst them. So you've got a complicated situation in Poland in a minute. So geopolitically, Poland is now more important than ever. You look at Europe is shifting. There's a whole sense of frontier states up against Russia. Poland is the most powerful one. It's the most populous one. It's the richest one. It's the most technologically advanced one. And in many ways, historically, it's got all the reasons to fight as well, because there ain't no love lost between these two, the Russians and the Poles. And the Russians have done unspeakable things to Polish, particularly middle class officer class, the Katyn massacre, all that stuff. We know all that, right? But it also has this internal sociological divide between liberals and conservatives, which is real. It also is on a collision course with the EU over what they call judicial reform. You said judge nobbling. How does it all play out? And you've got 40 million of them. This is not a small country. Oh, we're 38. Yeah. And the sure answer is we're going to find out pretty soon because we've got the election in October. So in a few months, the opinion polls are really tight. So it's a very tricky situation for the current government. No government in the third republic has served more than two terms. Now the peace government is trying to try for a third one. And the reality of that, I think, is going to be a very close election. And that's despite the fact that the media is kind of under the control of the peace, at least the state media is. Now, as far as the situation geopolitically is concerned, I mean, you know, Germany and Russia were equal enemies of Poland. So the joke is, you know, so which one do you want to fight first? The answer is always Germany, because it's business for pleasure. So and, you know, there's no question that the polls and the bolts have been calling the alarm for quite a long time. You know, this invasion did not come out of a clear blue sky. The polls have been deeply concerned about what's been going on. And so are the bolts. And it's only now, I think, that countries like Germany inside the EU are going, ah, oh, wait a minute. Yeah, you might have been right about that one. It's caused a lot of confusion in political classes in Paris and Berlin that Warsaw isn't actually a bunch of nutters. They were right, because, you know, the temptation is, oh, they're just a bunch of backwoodsmen. And, you know, the peace government doesn't help itself. Most of them don't really speak other languages because they're the ones that didn't come to Ireland. So the guys who are challenging to get back power under Donald Tusk again, they could just do it. But it's going to be quite tricky because you've got the two big blocks, the civic platform and you've got the justice and law party. And the question about who wins is it's within three points. So it's going to be what coalitions can form. Extremely tight. Extremely tight. Now, let's just look at, finally, before we go. So you have Poland and Ukraine, a very strained relationship over many hundreds of years and a function of that moving borders. We start to talk about it at the very top. You've Poland and Germany, which is now got a very good relationship, but historically has got a very disastrous relationship. You've Poland and Russia, which has always been a disastrous relationship. It's always been an antagonistic relationship. Poland is now going to become NATO's superpower in Central Europe. And as you said, with an army and a populace that is up for the scrap, if it has to, unlike Germany's, for example. Do you see European sort of spheres of influence just moving increasingly towards Warsaw and away from the Paris of this world over time? I think that's already happened, don't you? I mean, the reality is that you couldn't get your opinion into the European Council very easily from the East. And now it's almost the first thing that happens when they start to discuss this. You get the European Council and the leaders of different governments. And the first thing is, what does Kaja Kalas say from Estonia? What does Mateusz Morawiecki from Poland say about this? So at least I think you've got a much more open mindset from the Western parts of the EU. But at the end of the day, when you're right that right, then it would be stupid not to accept that the Poles have made the right decisions. Now, it's going to be interesting because, of course, if the civic platform does come back into power, well, I mean, Donald Tusk knows all of the leaders of the EU. And he personally has a political brand which is immensely powerful. That, combined with the economic realities of Poland today, you know, the amazing growth, the open economy, the discipline, the focus on getting it right, that puts Poland in a pretty good situation. Now, we don't know how long this war will last. I mean, it's clearly not gone well for Russia, that's for sure. And, you know, ultimately, it's hard to see that Russia ends up with an enhanced power. But I'll tell you one thing, Poland definitely ends up with enhanced power as a result of this. James, we will leave it there. Great to see you. Thank you so much for that. Great to see you. And I'll see you again soon, hopefully. Look forward to it very much so. Who's exhausted by social media these days? eHarmony's new Dating Diaries study found even 56% of social first gen Z gets tired of social media. When it comes to connection, we want someone who truly gets us, not just online, but offline too. That's why eHarmony is different. Their compatibility quiz connects people looking for real love and helps you match with someone who will truly get you. eHarmony's process makes finding a connection genuine, not exhausting. So join the dating app that helps you find someone who gets you and see for yourself. eHarmony, get who gets you. Start free today. Think identity theft won't happen to you? Think again. There's a new victim every three seconds in the U.S. Over 15 million this year alone, and many don't even know they're victims. LifeLock alerts you to identity threats you could miss, even when you monitor your credit. If your identity is stolen, your dedicated U.S.-based restoration specialist will work to fix it. No one can prevent all identity theft, but everyone can save up to 25% their first year at lifelock.com slash ACAST. Identity theft protection starts here. Another fascinating guest there, Mark. James is a sweetheart. He's a really interesting man. Yeah. And what I realized as you were talking there and something you said at the beginning is actually how little I know about Poland, about its economy, et cetera. You know, when you're talking about this great leap forward as a word, the kind of generational jump. And what I loved was that quote, you're turning fish soup back into an aquarium. Brilliant. It's amazing. Well, I think, you know, it's a whole fascinating part of development economics, which is that because of technology, technology allows countries make technological leaps that weren't there in the past. I'll give you an example. You take a country like India is going to take years and years and years to lay fiber optic cables, to put in a telecom system, all that sort of stuff. Right. Yeah. Yeah. Yeah. And then suddenly overnight, because of 5G, they do it straight away. They do it in a totally different technology. So 5G technology allows poor countries to skip two or three generations of technological and infrastructure investment to go onto a higher growth plane. And this is what we're seeing all over the world, which is, you know, that the old countries and I, and I'm talking about France and Britain and Germany and the United States, right. The old very, very wealthy countries are finding it very difficult to understand how new countries are coming up so quickly and so fast. And one of the reasons they're coming up so quickly and so fast is they're actually making technological leaps. Another great example is think about, you know, the Cannes Institute, you know, that teaching mathematics on YouTube. This is bringing Harvard graduate level mathematics to anybody who has a Internet connection, right, all over the world. So suddenly you're seeing this leaping forward in education. And what the polls have done is they've leaped forward in technology. So rather than do what a lot of other countries, and it's an extremely, extremely contentious issue because the polls went for what they call the short sharp shock, right. They liberalized everything. And a lot of people will have said they should have done things much slower because the social cost of liberalizing too quickly after communism was this total destruction of income of a whole generation. Now, what happened? The polls is they emigrated. Yes, they had a kind of a safety valve to come here and go to the UK and work and, you know, and send money back as well. But what is proven is that it's worked extremely well for them. And I also think what happens is they benefit from scale and size. You know, size is very, very important. So the similar country in central and eastern Europe, if you want to call the whole region that it's a bit liberal, would have been Yugoslavia, you know, which also had about 30 million people, was a huge economy, made all sorts of stuff that broke up into its constituent parts. And all these smaller countries in Yugoslavia now have found it very, very difficult to actually put the pieces back together. I think the same is Czechoslovakia, you know, it's between Czech and Slovak. It takes a while for these countries to find their feet, whereas the polls always had this coherent Poland. Now, as James said, it was never geographically in the right place. But since 1945, that coherent Poland was one big mass that has helped them. But they have done extraordinary things. And when you go there, John, you should go there. I was there once. I went to Cracough many years ago, which I thought was a fantastic place. But, you know, you're in and out in the weekend, so you don't really get to see it. But what I was going to say that there is an interesting parallel as well with Ireland in the same ways we kind of jumped a generation as well. Absolutely. I know that we jump a generation, John, but we actually changed our capital, our industrial base completely in the end generation. Yeah. So we went from being a beer and biscuits economy, right? Basically, Guinness and Jacobs, they were the two big industries in this country in the 1930s. Right. If you think of it at independence. And then we were faffing around trying to figure things out. And then suddenly it's like, oh, Americans, multinationals, let's do that. That's our trick. And the polls have done the same thing. And in a way, all that western part of Poland that James is talking about beside Germany basically has become an outsourcing area from German manufacturing. So basically what the Germans have done is they've taken the Polish industrial base, which was always there. And the interesting thing about communist countries is they tended to have very well educated industrial bases. Right. And what they've done is the Germans have taken that. Capital has gone from Germany to Poland. Polish labor has fused that capital and created goods, which they sell back to the Germans. So it's sort of a virtuous circle all the time. And what James is saying is the eastern part of Poland is more conservative. It's more nationalist. It's beside Ukraine, inside Belarus. But what the western side of Poland is doing, it's kind of dragging the eastern side westwards all the time. And this sort of conflict at the heart. I mean, again, it should be not unusual for Irish people. You know, those conflicts that we had in the 80s between religious people and non-religious people, between conservative and liberal, even geographically between urban and rural, young and old. All those sort of fights are sort of playing out in Poland. But what I think James said, and this is the conclusion, is that here we have a country that at one stage had borders that reached as far east as Moscow. And as far south, it was all the way down south into the Austrian-Hungarian Empire. For many years, it disappeared completely. It then got divided by the Nazis and the Soviets. The country got squeezed in the Second World War. It shifted its axis after the Second World War. And bits of Poland that were in Ukraine became Ukraine. And bits of Germany that were in Poland became Poland. People moved around. It settled itself. It found its feet. And now it's nearly 40 million people smack in the centre of Europe. And I don't think Poland will ever be anything other than a major European country from here on in. And that's a big shift. So if it's a major European country and a growing power within Europe, how is that going to affect the power structure within Europe? Hugely, John. Shifting away from France to Germany. Hugely, hugely. I mean, at the beginning, at the fall of the Berlin Wall, the fear on the part of the Western Europeans was that Europe would, particularly Germany, would tilt towards the east. There's this German expression, DRAG NACH AUSTEN, which is the drive to the east. And this has always been a difficult part of German history. This is idea that on the one hand, you have the more Slavic orientated Prussian side of Germany, which was totally destroyed in the Second World War. We kind of forget that what was actually destroyed in the Second World War of Germany wasn't the Ruhrland and the Rhineland and Bavaria and Baden-Wittenberg and all those Western areas. It was actually the Prussian side. We get the East Prussia extended all the way out. Like all the way into what is now modern Russia, all the way Kaliningrad, all the way to Ukraine, all those places. So that gets destroyed. And there's always this sense that Germany will flip and go more eastern. And that was France was very, very worried about that for a long time. And Britain was worried. It has taken the war in Ukraine to make that a reality. That's the interesting thing. That nothing is the same after the war in Ukraine. The war in Ukraine is a European changing moment. As a result of that, what you have now is you have the Baltics and the Scandis are all now in NATO. So they're tied to the hip to Germany and Poland via NATO. You have a situation where the Ukrainians want to join the European Union as quickly as possible. What Putin may well have in effect guaranteed is that the European Union stretches at some stage in the future from Galway to Kharkiv, from Galway to Donbass in one straight line. Except for the UK. So you go around the UK, right? If you think about it, so it's from Galway to Donbass. And as it shifts to the east geographically, the center of gravity also shifts to the east and the center of gravity shifts, therefore, from Brussels to Warsaw. And the countries of the east become much more not dominant, but much more reflective of a pan-European idea. And that's why Western Europeans need to understand the Slav mentality, the Eastern European mentality, what makes these people tick, what their languages are. And I come back to that at the top. We need to learn their culture because their culture is going to be much more significant to us in the next 20 years than we ever thought imaginable. And in Ireland, because we have so many Poles anyway, and Lithuanians and Latvians, you know, they're right beside us. They're our neighbors at this stage. So what we're advocating for on the podcast is for InterCert Polish. InterCert Polish exams and InterCert Russian exams and you know, but no seriously. Get your Duolingo out. Hey guy, absolutely. We're going to have a test now next week. Me orals. Exactly. I'll talk to you later. Good luck. Talk to you next week. Think identity theft won't happen to you? Think again. There's a new victim every three seconds in the US. Over 15 million this year alone and many don't even know their victims. LifeLock alerts you to identity threats you could miss even when you monitor your credit. If your identity is stolen, your dedicated US based restoration specialist will work to fix it. No one can prevent all identity theft, but everyone can save up to 25 percent their first year at LifeLock.com slash Acast. Identity theft protection starts here. The United States Border Patrol has exciting and rewarding career opportunities with the nation's largest law enforcement organization. Border Patrol agents enjoy great pay, outstanding federal benefits and up to $20,000 in recruitment incentives for newly appointed agents. If you are looking for a way to serve something greater than yourself, consider the United States Border Patrol. Learn more online at cbp.gov slash careers slash usbp. That's cbp.gov slash careers slash usbp."}, "podcast_summary": "According to James Oates, a Scottish expert on Poland, the country has experienced significant economic growth over the past few decades, making it a European powerhouse. With a population of 38 million, Poland has modernized its infrastructure, developed a strong service sector, and attracted foreign investment. The economy has never been in a recession and has grown rapidly, even during the global financial crisis. Poland has also benefited from its proximity to Germany, which has become its biggest trading partner. However, Poland faces sociopolitical challenges, including a divide between the conservative rural areas and the more liberal urban centers. The ruling political party, which has close ties to the Catholic Church, has implemented policies restricting abortion and limiting LGBT rights, causing tension within the European Union. Furthermore, Poland's relationship with Russia remains strained, given historical conflicts and territorial disputes. However, in recent years, Poland has emerged as a key player in Central Europe, with its growing economy and strong military. The country's geopolitical position has become increasingly important in European affairs, and it continues to shape the balance of power within the EU. Overall, Poland's development and influence within Europe are expected to continue expanding in the coming years.", "podcast_guest": {"name": "Marcin", "org": "withlocals.com", "title": "", "summary": "Not Available"}, "podcast_highlights": "In this episode, the conversation focuses on Poland and its economic and political transformation in the past few decades. Key insights include:\n\n- Poland has experienced significant economic growth and modernization since the fall of communism. Its economy has grown rapidly, and it has attracted foreign investment and developed a strong service sector.\n- The country has made technological leaps, allowing it to skip generations of development and catch up with Western European countries. This has been driven by a focus on infrastructure, investment, and entrepreneurship.\n- Poland has a population of around 38 million people, making it a significant player in Europe. It has become an important economic and political power in the region.\n- The country faces sociopolitical challenges, including a conservative-liberal divide and tensions with the European Union over issues like judicial reform and social policies.\n- Poland's geopolitical position has become more important, with the country playing a key role in relations with Ukraine and Germany. It has also emerged as a strong NATO ally, with a well-equipped and capable military.\n- The upcoming election in Poland will be closely watched as it could shape the country's future trajectory and its relationship with the EU.\n\nOverall, Poland's transformation has been remarkable, and it has emerged as a significant player in Europe. Its economic growth, technological advances, and strategic location have positioned it as a key political and economic power in the region."}